//如果要获取主机信息，记得把 hostspecific 设置成true

//导入命名空间组件

//引入我们的公共模板文件
//引入命名空间



//定义我们的输出文件夹

//-----------------------------------------------------------------------------
//此代码由T4模板自动生成 By Jim
//生成时间 2019-10-18 09:08:45 
//对此文件的更改可能会导致不正确的行为，并且如果重新生成代码，这些更改将会丢失。
//-----------------------------------------------------------------------------

	//开始启动block块，参数是实体类文件名
    
	//开始启动block块，参数是实体类文件名
    
	//开始启动block块，参数是实体类文件名
    
	//开始启动block块，参数是实体类文件名
    
	//开始启动block块，参数是实体类文件名
    
	//开始启动block块，参数是实体类文件名
     

